#Pandas Day-2:

In [1]:
import pandas as pd
pd.__version__
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.9.23
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 69 Stepping 1, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.3
numpy                 : 2.0.1
pytz                  : 2024.1
dateutil              : 2.9.0.post0
pip                   : 25.1
Cython                : None
sphinx                : None
IPython               : 8.18.1
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : 1.4.2
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : None
lxml.etree            : None
matplotlib            : 3.9.4
numba                 : None
numexpr               : 2.10.1
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.13.1
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

#Make a DataFrame

In [2]:
df=pd.DataFrame({"col_a":[1,2,3],"b_col":[4,5,6]})
df.head()

   col_a  b_col
0      1      4
1      2      5
2      3      6

#Numpy use in dataframe:

In [3]:
import numpy as np
arr=np.array([[1,2,3,4],[5,6,7,8]])
arr=pd.DataFrame(arr)
arr

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

#numpy array

In [4]:
pd.DataFrame(np.random.rand(5,10), columns=list("abcdefgijh"))

,a,b,c,d,e,f,g,i,j,h
0,0.591044,0.928795,0.228285,0.311223,0.188294,0.673433,0.604372,0.438565,0.355615,0.867789
1,0.842285,0.090922,0.444110,0.355418,0.744239,0.058892,0.503525,0.203225,0.698811,0.119165
2,0.235186,0.954551,0.151108,0.435417,0.256035,0.947979,0.790887,0.806710,0.663431,0.509255
3,0.652451,0.479512,0.446304,0.610379,0.981844,0.243074,0.581094,0.752817,0.317925,0.812645
4,0.359368,0.882471,0.236636,0.646460,0.322862,0.873890,0.246440,0.103283,0.981607,0.522844

In [5]:
pd.DataFrame(np.random.rand(50,100))

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.514708,0.040643,0.982056,0.704542,0.291673,0.509703,0.792695,0.654866,0.463065,0.952457,...,0.199496,0.603981,0.561550,0.264061,0.888939,0.016924,0.591586,0.492715,0.094803,0.474742
1,0.959773,0.724939,0.438209,0.201165,0.434747,0.437262,0.910539,0.050797,0.013907,0.877752,...,0.963830,0.302683,0.986181,0.254881,0.157202,0.809132,0.430602,0.201814,0.902893,0.385959
2,0.290804,0.018215,0.784358,0.506848,0.547401,0.679814,0.137881,0.283885,0.309531,0.969247,...,0.823513,0.122217,0.173191,0.188771,0.274023,0.895924,0.804351,0.042670,0.659227,0.743618
3,0.550718,0.043266,0.363229,0.816333,0.086157,0.021937,0.222404,0.227350,0.616353,0.851459,...,0.908187,0.794697,0.452025,0.309208,0.675193,0.528534,0.232665,0.289891,0.555284,0.606694
4,0.994030,0.790540,0.711474,0.870194,0.680350,0.185282,0.437203,0.412514,0.029888,0.837120,...,0.514910,0.505311,0.508261,0.844625,0.799667,0.829946,0.647254,0.744904,0.662079,0.980289
5,0.906768,0.248485,0.765176,0.888317,0.177675,0.317870,0.946632,0.201169,0.492828,0.967592,...,0.075391,0.490131,0.264665,0.850357,0.536920,0.218944,0.450373,0.617706,0.650608,0.540969
6,0.931389,0.652695,0.762684,0.413193,0.748834,0.708815,0.142606,0.220544,0.278877,0.025053,...,0.798342,0.711108,0.470200,0.223556,0.275262,0.191965,0.626024,0.524910,0.028263,0.659537
7,0.725865,0.658455,0.315326,0.165667,0.227584,0.474600,0.134267,0.583454,0.437687,0.929751,...,0.022277,0.247231,0.985764,0.777902,0.002821,0.133353,0.185234,0.949373,0.172288,0.452431
8,0.545159,0.992490,0.625760,0.265366,0.223531,0.996635,0.175468,0.175331,0.997609,0.156797,...,0.889196,0.559459,0.992713,0.958151,0.299132,0.671406,0.147242,0.223838,0.460558,0.147660
9,0.496900,0.583931,0.885459,0.980555,0.600162,0.290295,0.363628,0.262283,0.457649,0.060885,...,0.979374,0.786769,0.457454,0.896453,0.458620,0.960090,0.145106,0.269707,0.949892,0.117869
10,0.112881,0.878260,0.401885,0.860631,0.782530,0.055492,0.023102,0.255958,0.475930,0.533375,...,0.051097,0.584217,0.516332,0.494658,0.557519,0.450160,0.464004,0.878656,0.231529,0.589561
11,0.866994,0.260518,0.938618,0.453461,0.592359,0.523856,0.449165,0.687157,0.141875,0.494283,...,0.909501,0.141482,0.500873,0.574000,0.695851,0.747916,0.702641,0.776683,0.964657,0.980874
12,0.199709,0.793421,0.270203,0.482465,0.672139,0.063478,0.610683,0.874155,0.799812,0.712176,...,0.730559,0.832800,0.737233,0.674234,0.856028,0.084884,0.426986,0.980417,0.290081,0.700879
13,0.167250,0.900414,0.772147,0.454937,0.219286,0.254300,0.550939,0.215977,0.756645,0.003515,...,0.891226,0.115800,0.432244,0.008328,0.192816,0.831058,0.241759,0.741668,0.352988,0.715432
14,0.932568,0.475777,0.459034,0.311766,0.557217,0.776316,0.749939,0.858274,0.032220,0.779091,...,0.278824,0.359173,0.176341,0.989763,0.025563,0.219040,0.308699,0.070447,0.033220,0.234962
15,0.908863,0.335953,0.275649,0.021305,0.797510,0.895278,0.198123,0.016478,0.174178,0.995034,...,0.447390,0.227226,0.294073,0.265894,0.539085,0.654717,0.128913,0.052868,0.721086,0.071728
16,0.379133,0.728916,0.190055,0.457092,0.749192,0.677578,0.037088,0.313416,0.719432,0.733066,...,0.735907,0.587593,0.975137,0.857794,0.993977,0.930693,0.173692,0.347694,0.069491,0.188183
17,0.233533,0.363673,0.653090,0.751095,0.164491,0.042173,0.581694,0.079485,0.616572,0.564614,...,0.123751,0.622468,0.644249,0.636509,0.276817,0.446167,0.223084,0.110446,0.583193,0.736456
18,0.787730,0.585842,0.695133,0.931061,0.924071,0.493796,0.490681,0.665040,0.427475,0.954010,...,0.941012,0.594449,0.670524,0.853004,0.260245,0.673334,0.166961,0.719905,0.299036,0.884288
19,0.108618,0.570441,0.765734,0.283631,0.349483,0.497493,0.979553,0.877748,0.877021,0.515591,...,0.255259,0.659562,0.372989,0.150972,0.755286,0.188311,0.669712,0.014256,0.622557,0.596186
20,0.594789,0.205986,0.895461,0.642227,0.294540,0.476558,0.416763,0.078975,0.504108,0.846751,...,0.467515,0.516975,0.677088,0.063728,0.633878,0.329281,0.158335,0.150017,0.519768,0.041208
21,0.543880,0.759292,0.767502,0.237113,0.627983,0.220646,0.630185,0.629953,0.589523,0.866454,...,0.467991,0.145330,0.014587,0.966196,0.796236,0.792866,0.497671,0.262324,0.448214,0.377589
22,0.371053,0.591647,0.872109,0.216679,0.584981,0.292905,0.059588,0.311048,0.612536,0.232180,...,0.247548,0.828860,0.017337,0.383101,0.635860,0.096867,0.156569,0.159349,0.206504,0.948893
23,0.104805,0.013899,0.112652,0.127781,0.665413,0.685562,0.108822,0.186267,0.614367,0.432776,...,0.170820,0.888036,0.036997,0.999716,0.158156,0.047791,0.234800,0.922197,0.461251,0.781984
24,0.139854,0.317939,0.724409,0.577476,0.936929,0.519768,0.710066,0.205062,0.931565,0.557611,...,0.265286,0.734973,0.025785,0.322963,0.288498,0.059361,0.261334,0.877029,0.249684,0.318947
25,0.214708,0.868369,0.606689,0.905636,0.827430,0.157265,0.136266,0.571390,0.702438,0.372926,...,0.801678,0.642596,0.327505,0.310351,0.748519,0.880431,0.101773,0.060441,0.982820,0.834084
26,0.076359,0.155956,0.996178,0.802404,0.202509,0.133136,0.538111,0.455121,0.477729,0.945891,...,0.847732,0.690758,0.997854,0.528526,0.646285,0.992340,0.273239,0.663367,0.203152,0.963181
27,0.539448,0.756851,0.991744,0.713657,0.848584,0.685781,0.472906,0.541238,0.295742,0.963290,...,0.056325,0.277203,0.187996,0.426567,0.692386,0.726781,0.192588,0.942320,0.554380,0.436123
28,0.059244,0.312135,0.354912,0.494166,0.842598,0.617411,0.963474,0.820141,0.572645,0.663612,...,0.989762,0.332964,0.911378,0.111565,0.174376,0.813506,0.590404,0.917761,0.851423,0.681346
29,0.260860,0.050748,0.191785,0.759357,0.153391,0.610060,0.410560,0.471525,0.661376,0.527966,...,0.097516,0.649213,0.030576,0.355461,0.334611,0.976699,0.733546,0.105484,0.920603,0.207664
30,0.227378,0.210237,0.143866,0.737335,0.845039,0.427576,0.766020,0.733514,0.693641,0.134713,...,0.684113,0.231205,0.434002,0.548792,0.080676,0.325645,0.956864,0.632848,0.989438,0.093172
31,0.811726,0.248715,0.731358,0.332397,0.872580,0.859159,0.598637,0.552779,0.921380,0.920098,...,0.627938,0.874724,0.945806,0.041441,0.142438,0.626568,0.679045,0.439941,0.122694,0.692046
32,0.745193,0.054865,0.139242,0.571666,0.743511,0.668791,0.796217,0.859038,0.634688,0.682820,...,0.108142,0.921543,0.480638,0.098868,0.646394,0.827658,0.676427,0.861906,0.375446,0.502923
33,0.776199,0.610123,0.173765,0.443142,0.793299,0.835208,0.896390,0.806466,0.644248,0.494111,...,0.340205,0.095206,0.892141,0.152917,0.527659,0.670967,0.133332,0.834130,0.856590,0.714922
34,0.258974,0.228590,0.857950,0.423242,0.355422,0.357909,0.151563,0.527648,0.989794,0.821473,...,0.353089,0.189802,0.671068,0.914514,0.607318,0.238794,0.828531,0.202220,0.711933,0.297406
35,0.467480,0.376149,0.972324,0.565666,0.309357,0.879003,0.476102,0.509669,0.741589,0.783280,...,0.636991,0.419694,0.178100,0.108621,0.499968,0.759716,0.898421,0.244516,0.896753,0.354162
36,0.780609,0.521859,0.040686,0.025100,0.205830,0.742545,0.691534,0.529119,0.768519,0.384793,...,0.930737,0.565799,0.496577,0.882274,0.205721,0.556579,0.947542,0.455358,0.901218,0.314382
37,0.483826,0.319326,0.070099,0.399353,0.768248,0.650750,0.165378,0.239795,0.006393,0.395935,...,0.805061,0.566262,0.784260,0.449880,0.803456,0.842879,0.528618,0.145890,0.304621,0.948242
38,0.323395,0.623662,0.321149,0.066699,0.689441,0.668916,0.415073,0.796593,0.314455,0.650374,...,0.362883,0.188617,0.194601,0.225756,0.428278,0.075609,0.465001,0.299820,0.982611,0.538513
39,0.855264,0.240940,0.318593,0.185097,0.660461,0.199611,0.619810,0.288494,0.462127,0.061846,...,0.156571,0.330720,0.654048,0.285263,0.647579,0.395000,0.343836,0.871169,0.947177,0.637308
40,0.271102,0.596312,0.687170,0.551183,0.104829,0.753922,0.564165,0.638738,0.331238,0.360910,...,0.421987,0.488232,0.793441,0.754769,0.182106,0.981779,0.467554,0.792887,0.054179,0.842997
41,0.498552,0.789289,0.424897,0.391402,0.293894,0.231092,0.083726,0.626502,0.480987,0.412456,...,0.394203,0.675225,0.042303,0.269670,0.676041,0.275495,0.642625,0.296294,0.770600,0.342970
42,0.350263,0.070482,0.723695,0.094545,0.653950,0.911120,0.953657,0.465278,0.302237,0.953708,...,0.260669,0.048715,0.505565,0.094876,0.952640,0.046670,0.717063,0.850898,0.976112,0.635286
43,0.430739,0.720997,0.601974,0.741698,0.598477,0.584340,0.292325,0.356710,0.253373,0.064104,...,0.884475,0.151279,0.169553,0.870532,0.842578,0.359614,0.663129,0.844518,0.176136,0.734540
44,0.253878,0.732590,0.215646,0.068607,0.566779,0.576204,0.753496,0.446011,0.970304,0.664692,...,0.478745,0.019854,0.233174,0.421616,0.613662,0.832744,0.981679,0.223027,0.923782,0.734254
45,0.971556,0.509640,0.218208,0.910787,0.823139,0.189858,0.409202,0.136110,0.774973,0.156820,...,0.265715,0.263587,0.857131,0.690327,0.267297,0.643664,0.240896,0.345663,0.837999,0.372641
46,0.377307,0.124807,0.462818,0.523745,0.344410,0.593961,0.374426,0.829532,0.443030,0.138682,...,0.272324,0.691891,0.601423,0.340189,0.562065,0.831938,0.370495,0.184950,0.000421,0.195046
47,0.523567,0.251822,0.914584,0.458698,0.375835,0.759720,0.230654,0.994647,0.945335,0.788691,...,0.563591,0.411418,0.844771,0.009952,0.339321,0.074405,0.917583,0.029980,0.706129,0.262910
48,0.619122,0.626004,0.118733,0.041026,0.591502,0.322372,0.570642,0.266758,0.094919,0.844468,...,0.606872,0.976154,0.552455,0.419887,0.686223,0.395742,0.274173,0.441731,0.751806,0.666284
49,0.873470,0.642903,0.455112,0.550779,0.460800,0.697049,0.936011,0.965598,0.208521,0.643607,...,0.060721,0.600315,0.639594,0.264668,0.717743,0.420430,0.565152,0.588118,0.109530,0.028814

#rename the columns:

In [6]:
df=pd.DataFrame({"a":[1,2,3],"b":[4,5,6]})
df
df.rename(columns={"a":"col_a","b":"col_b"}, inplace=True)
df.columns=["col a", "col b"]#short forms of renaming
df

   col a  col b
0      1      4
1      2      5
2      3      6

#to replace any character or string:

In [7]:
df=pd.DataFrame({"col_a":[1,2,3],"col_b":[4,5,6]})
df.columns=df.columns.str.replace("_","-")
df

   col-a  col-b
0      1      4
1      2      5
2      3      6

#add prefix

In [8]:
df=pd.DataFrame({"col_a":[1,2,3],"col_b":[4,5,6]})
df=df.add_prefix("gull_")
df

   gull_col_a  gull_col_b
0           1           4
1           2           5
2           3           6

#add suffix:

In [9]:
df=pd.DataFrame({'cell_1':[1,2,3,4,5,6],"col_2":[6,7,8,9,0,1]})
df=df.add_suffix("0")
# df

#Using Templates data:

In [10]:
import pandas as pd
import numpy as np
import seaborn as sns
df=sns.load_dataset("tips")
# df

#describe data

In [11]:
import pandas as pd
import numpy as np
import seaborn as sns
df=sns.load_dataset("tips")
# df.describe()

#columns name

In [12]:
import pandas as pd
import numpy as np
import seaborn as sns
df=sns.load_dataset("tips")
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [13]:
df.to_csv("tips_save.csv")#csv file mai data store
df.to_excel("tips_save.xlsx")#excel sheet mai data store

#Using your own data:

In [14]:
import pandas as pd
df=pd.read_csv("tips_save.csv")#csv file
# df.head()

In [15]:
import pandas as pd
df=pd.read_excel("tips_save.xlsx")#csv file
# df.head()

In [16]:
import pandas as pd
df=pd.read_csv("tips_save.csv")
# df.columns

#Reverse row order:

In [17]:
import seaborn as sns
import pandas as pd
df= sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
df.loc[::-1].head()#reverse order

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [19]:
df.loc[::-1].reset_index(drop=True).head()#reverse order or index arrangement

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

#column reverse:

In [20]:
df.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

#Select a columns by dtype:

In [21]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

#Only select numberic type:

In [22]:
df.select_dtypes(include="number").head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

 #Only select string type:

In [23]:
df.select_dtypes(include="object").head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

select both numberic and obj:

In [24]:
df.select_dtypes(include=["number","category", "object"]).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no

In [25]:
df.select_dtypes(exclude="object").head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

In [26]:
df.select_dtypes(exclude=["number", "category"]).head()

      sex embarked    who  adult_male  embark_town alive  alone
0    male        S    man        True  Southampton    no  False
1  female        C  woman       False    Cherbourg   yes  False
2  female        S  woman       False  Southampton   yes   True
3  female        S  woman       False  Southampton   yes  False
4    male        S    man        True  Southampton    no   True

#convert string into numbers:

In [27]:
df=pd.DataFrame({"col a":['1.4','2','3','4','5'], "col b": ['6','7','8','9','10']})
df

  col a col b
0   1.4     6
1     2     7
2     3     8
3     4     9
4     5    10

In [28]:
df.dtypes

col a    object
col b    object
dtype: object

In [29]:
df.astype({"col a": "float64", "col b": "int64"}).dtypes

col a    float64
col b      int64
dtype: object

In [30]:
pd.to_numeric(df["col a"], errors="coerce")
pd.to_numeric(df["col b"], errors="coerce")

0     6
1     7
2     8
3     9
4    10
Name: col b, dtype: int64

Reduce dataframe size:

In [31]:
df= sns.load_dataset("titanic")
df.shape

(891, 15)

In [32]:
df.sample(frac=0.1).shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

Copy data from clipboard:

In [ ]:
import pandas as pd
import seaborn as sns
df=sns.load_dataset("titanic")
df.to_excel("boat.xlsx")

Read clipboard in python

In [ ]:
df=pd.read_clipboard()
df
df.to_excel("dataset_of_clipboard.xlsx")

Split dataframe into two data sets:

In [35]:
import pandas as pd
import seaborn as sns
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [36]:
len(df)

891

In [37]:
df.shape

(891, 15)

In [38]:
from random import random
boat_1=df.sample(frac=0.5, random_state=1)
boat_1.shape

(446, 15)

In [39]:
boat_2=df.drop(boat_1.index)
boat_2.shape

(445, 15)

In [40]:
boat_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [41]:
boat_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [42]:
df.shape

(891, 15)

In [43]:
len(boat_1) + len(boat_2)

891

join two datasets:

In [44]:
df1=boat_1.append(boat_2)
df1.shape

AttributeError: 'DataFrame' object has no attribute 'append'

Filtering a dataset:

In [ ]:
df.head()

In [ ]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
df[(df.sex=="female")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
df[(df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True